app/controllers/participants_controller.rb

  def index
    @participants = Participant.all
---
SELECT * FROM "participants"

  def show
    @participant = Participant.find(params[:id])
---
SELECT * FROM "participants" WHERE ("participants"."id" = 0)